<a href="https://clarusway.com/contact-us/"><img align="center" src="https://i.ibb.co/B43qn24/officially-licensed-logo.png" alt="Open in Clarusway LMS" width="110" height="200" title="This notebook is licensed by Clarusway IT training school. Please contact the authorized persons about the conditions under which you can use or share."></a>

# Example -1 Inclass Data

In [1]:
import pandas as pd
import seaborn as sns
from scipy.stats import chi2_contingency

In [2]:
table = [[15, 21, 45, 13],[26, 31, 34, 5], [33, 17, 49, 20]]

In [3]:
# Ho: The two categorical variables are independent.
# H1: The two categorical variables are dependent.

In [4]:
stat, p, dof, expected = chi2_contingency(table)

In [5]:
print('stat=%.3f, p=%.4f' % (stat, p))
if p > 0.05:
	print('Fail to reject Ho')
else:
	print('We reject the null hypothesis. The two categorical variables are dependent')

stat=19.178, p=0.0039
We reject the null hypothesis. The two categorical variables are dependent

In [6]:
expected

array([[22.51132686, 20.99029126, 38.93851133, 11.55987055],
       [22.99029126, 21.4368932 , 39.76699029, 11.80582524],
       [28.49838188, 26.57281553, 49.29449838, 14.63430421]])

In [7]:
dof

6

In [8]:
# We can get the same result with manual method
from scipy import stats
1 - stats.chi2.cdf(19.17, 6)

0.0038859579107577424

# Example -2 Titanic Dataset

In [9]:
titanic = sns.load_dataset("titanic")
titanic.sample(7)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
48,0,3,male,NaN,2,0,21.6792,C,Third,man,True,NaN,Cherbourg,no,False
655,0,2,male,24.0,2,0,73.5000,S,Second,man,True,NaN,Southampton,no,False
76,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
686,0,3,male,14.0,4,1,39.6875,S,Third,child,False,NaN,Southampton,no,False
51,0,3,male,21.0,0,0,7.8000,S,Third,man,True,NaN,Southampton,no,True
173,0,3,male,21.0,0,0,7.9250,S,Third,man,True,NaN,Southampton,no,True
393,1,1,female,23.0,1,0,113.2750,C,First,woman,False,D,Cherbourg,yes,False

How many rows and columns

In [10]:
titanic.shape

(891, 15)

How many null values are there in columns?

In [11]:
titanic.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [12]:
titanic=titanic.drop(["deck", "age"], axis=1)

In [13]:
titanic=titanic.dropna()

In [14]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 889 entries, 0 to 890
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     889 non-null    int64
 1   pclass       889 non-null    int64
 2   sex          889 non-null    object
 3   sibsp        889 non-null    int64
 4   parch        889 non-null    int64
 5   fare         889 non-null    float64
 6   embarked     889 non-null    object
 7   class        889 non-null    category
 8   who          889 non-null    object
 9   adult_male   889 non-null    bool
 10  embark_town  889 non-null    object
 11  alive        889 non-null    object
 12  alone        889 non-null    bool
dtypes: bool(2), category(1), float64(1), int64(4), object(5)
memory usage: 79.1+ KB

In [15]:
titanic2=titanic.sample(200, random_state=42) # daha kolay anlamamız için 200 aldık.

In [21]:
# Does gender affects survival ?

In [22]:
# We can see both male and female survivors using a crosstab
crosstab = pd.crosstab(titanic2.survived, titanic2.sex)
crosstab

sex       female  male
survived
0             24   101
1             56    19

In [24]:
# Ho: The two categorical variables (gender and survived) are independent.
# H1: The two categorical variables are dependent.

In [25]:
from scipy import stats
stat, p, dof, expected = stats.chi2_contingency(crosstab)
print('stat=%.3f, p=%.4f' % (stat, p))

stat=57.800, p=0.0000

In [26]:
if p > 0.05:
	print('Fail to reject Ho')
else:
	print('We reject the null hypothesis. Gender and survived variables are dependent')

We reject the null hypothesis. Gender and survived variables are dependent

# Example-3 Titanic Dataset

In [28]:
# Does class affect survival? In other words Class and survived variables are dependent or not?

In [29]:
crosstab = pd.crosstab(titanic2["survived"], titanic2["class"])
crosstab

class     First  Second  Third
survived
0            16      27     82
1            32      18     25

In [30]:
stat, p, dof, expected = stats.chi2_contingency(crosstab)
print('stat=%.3f, p=%.4f' % (stat, p))

stat=26.664, p=0.0000

In [31]:
if p > 0.05:
	print('Fail to reject Ho')
else:
	print('We reject the null hypothesis. Class and survived variables are dependent')

We reject the null hypothesis. Class and survived variables are dependent

In [33]:
crosstab = pd.crosstab(titanic2["embarked"], titanic2["class"])
crosstab

class     First  Second  Third
embarked
C            21       2     15
Q             1       2     12
S            26      41     80

In [34]:
#crosstab = pd.crosstab(titanic2["embarked"], titanic2["class"], normalize="columns")
#crosstab

In [35]:
stat, p, dof, expected = stats.chi2_contingency(crosstab)
print('stat=%.3f, p=%.4f' % (stat, p))

stat=30.661, p=0.0000

In [36]:
mpg = sns.load_dataset("mpg")
mpg.sample(7)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
6,14.0,8,454.0,220.0,4354,9.0,70,usa,chevrolet impala
57,24.0,4,113.0,95.0,2278,15.5,72,japan,toyota corona hardtop
63,14.0,8,400.0,175.0,4385,12.0,72,usa,pontiac catalina
294,34.1,4,86.0,65.0,1975,15.2,79,japan,maxda glc deluxe
182,28.0,4,107.0,86.0,2464,15.5,76,europe,fiat 131
205,28.0,4,97.0,75.0,2155,16.4,76,japan,toyota corolla
268,27.2,4,119.0,97.0,2300,14.7,78,japan,datsun 510

In [37]:
crosstab = pd.crosstab(mpg["origin"], mpg["cylinders"])
crosstab

cylinders  3   4  5   6    8
origin
europe     0  63  3   4    0
japan      4  69  0   6    0
usa        0  72  0  74  103

In [38]:
stat, p, dof, expected = stats.chi2_contingency(crosstab)
print('stat=%.3f, p=%.4f' % (stat, p))

stat=180.102, p=0.0000

In [40]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [41]:
mpg = sns.load_dataset("penguins")
mpg.sample(7)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
190,Chinstrap,Dream,46.9,16.6,192.0,2700.0,Female
282,Gentoo,Biscoe,45.7,13.9,214.0,4400.0,Female
126,Adelie,Torgersen,38.8,17.6,191.0,3275.0,Female
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female
107,Adelie,Biscoe,38.2,20.0,190.0,3900.0,Male
35,Adelie,Dream,39.2,21.1,196.0,4150.0,Male
67,Adelie,Biscoe,41.1,19.1,188.0,4100.0,Male

In [42]:
crosstab = pd.crosstab(mpg["species"], mpg["island"])
crosstab

island     Biscoe  Dream  Torgersen
species
Adelie         44     56         52
Chinstrap       0     68          0
Gentoo        124      0          0

In [43]:
stat, p, dof, expected = stats.chi2_contingency(crosstab)
print('stat=%.3f, p=%.4f' % (stat, p))

stat=299.550, p=0.0000

In [45]:
if p > 0.05:
	print('Fail to reject Ho')
else:
	print('We reject the null hypothesis. species and island variables are dependent')

We reject the null hypothesis. species and island variables are dependent

In [48]:
crosstab = pd.crosstab(mpg["sex"], mpg["species"])
crosstab

species  Adelie  Chinstrap  Gentoo
sex
Female       73         34      58
Male         73         34      61

In [49]:
stat, p, dof, expected = stats.chi2_contingency(crosstab)
print('stat=%.3f, p=%.4f' % (stat, p))

stat=0.049, p=0.9760

In [50]:
if p > 0.05:
	print('Fail to reject Ho')
else:
	print('We reject the null hypothesis. species and sex variables are dependent')

Fail to reject Ho